# Sql Tutorial with particular schema..in Jupyter notebook...

In [1]:
import sqlalchemy

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

In [3]:
sqlalchemy.create_engine('mysql://root:root@localhost/student_2020')

Engine(mysql://root:***@localhost/student_2020)

In [4]:
%load_ext sql

In [5]:
%sql mysql://root:root@localhost/student_2020

In [7]:
%%sql
show databases;

 * mysql://root:***@localhost/student_2020
13 rows affected.

[('Animals',),
 ('Bank',),
 ('IIITMK',),
 ('Notetest',),
 ('Student',),
 ('fkdemo',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('student_2020',),
 ('student_2020_feb06',),
 ('sys',),
 ('test',)]

In [8]:
%%sql
create database The_Computer_Store;

 * mysql://root:***@localhost/student_2020
1 rows affected.

[]

In [9]:
%%sql
use The_Computer_Store;
CREATE TABLE Manufacturers (
  Code INTEGER,
  Name VARCHAR(255) NOT NULL,
  PRIMARY KEY (Code)   
);

 * mysql://root:***@localhost/student_2020
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
show tables;

 * mysql://root:***@localhost/student_2020
1 rows affected.

[('Manufacturers',)]

In [11]:
%%sql
CREATE TABLE Products (
  Code INTEGER,
  Name VARCHAR(255) NOT NULL ,
  Price DECIMAL NOT NULL ,
  Manufacturer INTEGER NOT NULL,
  PRIMARY KEY (Code), 
  FOREIGN KEY (Manufacturer) REFERENCES Manufacturers(Code)
) ENGINE=INNODB;

 * mysql://root:***@localhost/student_2020
0 rows affected.

[]

In [12]:
%%sql
show tables;

 * mysql://root:***@localhost/student_2020
2 rows affected.

[('Manufacturers',), ('Products',)]

In [13]:
%%sql
INSERT INTO Manufacturers(Code,Name) VALUES(1,'Sony');
INSERT INTO Manufacturers(Code,Name) VALUES(2,'Creative Labs');
INSERT INTO Manufacturers(Code,Name) VALUES(3,'Hewlett-Packard');
INSERT INTO Manufacturers(Code,Name) VALUES(4,'Iomega');
INSERT INTO Manufacturers(Code,Name) VALUES(5,'Fujitsu');
INSERT INTO Manufacturers(Code,Name) VALUES(6,'Winchester');

 * mysql://root:***@localhost/student_2020
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(1,'Hard drive',240,5);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(2,'Memory',120,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(3,'ZIP drive',150,4);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(4,'Floppy disk',5,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(5,'Monitor',240,1);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(6,'DVD drive',180,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(7,'CD drive',90,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(8,'Printer',270,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(9,'Toner cartridge',66,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(10,'DVD burner',180,2);

 * mysql://root:***@localhost/student_2020
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql
select Name from Products;

 * mysql://root:***@localhost/student_2020
10 rows affected.

[('Hard drive',),
 ('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('Monitor',),
 ('DVD drive',),
 ('CD drive',),
 ('Printer',),
 ('Toner cartridge',),
 ('DVD burner',)]

In [19]:
%%sql
/*Select the names and the prices of all the products in the store.*/
select name, price from Products;

 * mysql://root:***@localhost/student_2020
10 rows affected.

[('Hard drive', Decimal('240')),
 ('Memory', Decimal('120')),
 ('ZIP drive', Decimal('150')),
 ('Floppy disk', Decimal('5')),
 ('Monitor', Decimal('240')),
 ('DVD drive', Decimal('180')),
 ('CD drive', Decimal('90')),
 ('Printer', Decimal('270')),
 ('Toner cartridge', Decimal('66')),
 ('DVD burner', Decimal('180'))]

In [21]:
%%sql 
select name,price from Products where price <= 200;

 * mysql://root:***@localhost/student_2020
7 rows affected.

[('Memory', Decimal('120')),
 ('ZIP drive', Decimal('150')),
 ('Floppy disk', Decimal('5')),
 ('DVD drive', Decimal('180')),
 ('CD drive', Decimal('90')),
 ('Toner cartridge', Decimal('66')),
 ('DVD burner', Decimal('180'))]

In [25]:
%%sql
select name,price from Products where price BETWEEN 60 and 120;

 * mysql://root:***@localhost/student_2020
3 rows affected.

[('Memory', Decimal('120')),
 ('CD drive', Decimal('90')),
 ('Toner cartridge', Decimal('66'))]

In [28]:
%%sql
select name,100*price as cents from Products;

 * mysql://root:***@localhost/student_2020
10 rows affected.

[('Hard drive', Decimal('24000')),
 ('Memory', Decimal('12000')),
 ('ZIP drive', Decimal('15000')),
 ('Floppy disk', Decimal('500')),
 ('Monitor', Decimal('24000')),
 ('DVD drive', Decimal('18000')),
 ('CD drive', Decimal('9000')),
 ('Printer', Decimal('27000')),
 ('Toner cartridge', Decimal('6600')),
 ('DVD burner', Decimal('18000'))]

In [29]:
%%sql
select avg(price) from Products

 * mysql://root:***@localhost/student_2020
1 rows affected.

[(Decimal('154.1000'),)]

In [30]:
%%sql 
select avg(price) from Products where Manufacturer=2;

 * mysql://root:***@localhost/student_2020
1 rows affected.

[(Decimal('150.0000'),)]

In [32]:
%%sql
select count(*) from Products where price>=180;

 * mysql://root:***@localhost/student_2020
1 rows affected.

[(5,)]

In [33]:
%%sql
-- 1.13 Select the average price of each manufacturer's products, showing the manufacturer's name.
select avg(a.price), b.name 
from Products a join Manufacturers b 
on a.manufacturer = b.code
group by b.name;

 * mysql://root:***@localhost/student_2020
6 rows affected.

[(Decimal('240.0000'), 'Sony'),
 (Decimal('150.0000'), 'Creative Labs'),
 (Decimal('168.0000'), 'Hewlett-Packard'),
 (Decimal('150.0000'), 'Iomega'),
 (Decimal('240.0000'), 'Fujitsu'),
 (Decimal('62.5000'), 'Winchester')]

In [39]:
%%sql
(SELECT Manufacturers.Name, MAX(Price) price
     FROM Products, Manufacturers
     WHERE Manufacturer = Manufacturers.Code
     GROUP BY Manufacturers.Name)

 * mysql://root:***@localhost/student_2020
6 rows affected.

[('Sony', Decimal('240')),
 ('Creative Labs', Decimal('180')),
 ('Hewlett-Packard', Decimal('270')),
 ('Iomega', Decimal('150')),
 ('Fujitsu', Decimal('240')),
 ('Winchester', Decimal('120'))]

In [ ]:
#we will update this soon..